zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/svd/PIC32CZ1038CA70144.svd
            <register>
               <name>GMAC_ST2CW13</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 3)</description>
               <addressOffset>0x71C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW04</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 4)</description>
               <addressOffset>0x720</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW14</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 4)</description>
               <addressOffset>0x724</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW05</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 5)</description>
               <addressOffset>0x728</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW15</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 5)</description>
               <addressOffset>0x72C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW06</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 6)</description>
               <addressOffset>0x730</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW16</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 6)</description>
               <addressOffset>0x734</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW07</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 7)</description>
               <addressOffset>0x738</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW17</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 7)</description>
               <addressOffset>0x73C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW08</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 8)</description>
               <addressOffset>0x740</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW18</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 8)</description>
               <addressOffset>0x744</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW09</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 9)</description>
               <addressOffset>0x748</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW19</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 9)</description>
               <addressOffset>0x74C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW010</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 10)</description>
               <addressOffset>0x750</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW110</name>
               <description>Screening Type 2 Compare Word 1 Register (index = 10)</description>
               <addressOffset>0x754</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSVAL</name>
                     <description>Offset Value in Bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFFSSTRT</name>
                     <description>Ethernet Frame Offset Start</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FRAMESTART</name>
                           <description>Offset from the start of the frame</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHERTYPE</name>
                           <description>Offset from the byte after the EtherType field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IP</name>
                           <description>Offset from the byte after the IP header field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_UDP</name>
                           <description>Offset from the byte after the TCP/UDP header field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ST2CW011</name>
               <description>Screening Type 2 Compare Word 0 Register (index = 11)</description>
               <addressOffset>0x758</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASKVAL</name>
                     <description>Mask Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>COMPVAL</name>
                     <description>Compare Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
