zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/svd/PIC32CZ1038CA70144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>MPU</name>
         <description>Memory Protection Unit Registers</description>
         <groupName>MPU</groupName>
         <prependToName>MPU_</prependToName>
         <baseAddress>0xE000ED90</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x14</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MPU_TYPE</name>
               <description>MPU Type Register</description>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SEPARATE</name>
                     <description>Indicates support for unified or separate instruction and date memory maps.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DREGION</name>
                     <description>Indicates the number of supported MPU instruction regions.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IREGION</name>
                     <description>Indicates the number of supported MPU data regions.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MPU_CTRL</name>
               <description>MPU Control Register</description>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Enables the MPU</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HFNMIENA</name>
                     <description>Enables the operation of MPU during hard fault, NMI, and FAULTMASK handlers.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVDEFENA</name>
                     <description>Enables privileged software access to the default memory map.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MPU_RNR</name>
               <description>MPU Region Number Register</description>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>REGION</name>
                     <description>Indicates the MPU region referenced by the MPU_RBAR and MPU_RASR registers.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MPU_RBAR</name>
               <description>MPU Region Base Address Register</description>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>REGION</name>
                     <description>MPU region field.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>VALID</name>
                     <description>MPU Region Number valid bit.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDR</name>
                     <description>Region base address field.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>27</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MPU_RASR</name>
               <description>MPU Region Attribute and Size Register</description>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Region enable bit.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIZE</name>
                     <description>Specifies the size of the MPU protection region.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SRD</name>
                     <description>Subregion disable bits.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>B</name>
                     <description>MPU access permission attributes.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>C</name>
                     <description>MPU access permission attributes.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S</name>
                     <description>Shareable bit.</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEX</name>
                     <description>MPU access permission attributes.</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>AP</name>
                     <description>Access permission field.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>XN</name>
                     <description>Instruction access disable bit.</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
