zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/svd/PIC32CZ1038CA70144.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>FPU</name>
         <description>Floating Point Unit Registers</description>
         <groupName>FPU</groupName>
         <prependToName>FPU_</prependToName>
         <baseAddress>0xE000EF34</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>FPCCR</name>
               <description>Floating-point Context Control Register</description>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LSPACT</name>
                     <description>Lazy state preservation is active. Floating-point stack frame has been allocated but saving state to it has been deferred.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER</name>
                     <description>Privilege level was user when the floating-point stack frame was allocated.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>THREAD</name>
                     <description>Mode was Thread Mode when the floating-point stack frame was allocated.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HFRDY</name>
                     <description>Priority permitted setting the HardFault handler to the pending state when the floating-point stack frame was allocated.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MMRDY</name>
                     <description>MemManage is enabled and priority permitted setting the MemManage handler to the pending state when the floating-point stack frame was allocated.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BFRDY</name>
                     <description>BusFault is enabled and priority permitted setting the BusFault handler to the pending state when the floating-point stack frame was allocated.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MONRDY</name>
                     <description>DebugMonitor is enabled and priority permits setting MON_PEND when the floating-point stack frame was allocated.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LSPEN</name>
                     <description>Enable automatic lazy state preservation for floating-point context.</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ASPEN</name>
                     <description>Enables CONTROL.FPCA setting on execution of a floating-point instruction. This results in automatic hardware state preservation and restoration, for floating-point context, on exception entry and exit.</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FPCAR</name>
               <description>Floating-point Context Address Register</description>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDRESS</name>
                     <description>The location of the unpopulated floating-point register space allocated on an exception stack frame.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>29</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FPDSCR</name>
               <description>Floating-point Default Status Control Register</description>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RMode</name>
                     <description>Default value for FPSCR.RMode.</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>FZ</name>
                     <description>Default value for FPSCR.FZ.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DN</name>
                     <description>Default value for FPSCR.DN.</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHP</name>
                     <description>Default value for FPSCR.AHP.</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
   </peripherals>
</device>
